Public Attributes | List of all members
API_ObjectQuantity Struct Reference
Element Manager API
Describes the different calculated values for objects. More...
#include <APIdefs_Elements.h>
 Public Attributes
double  | surface
surface of the object
double  | volume
volume of the object
Detailed Description
Describes the different calculated values for objects.
Remarks
These parameters are calculated from the 3D model of the object. See also API_LightQuantity.
Member Data Documentation
◆ surface
 API_ObjectQuantity::surface
surface of the object
◆ volume
 API_ObjectQuantity::volume
volume of the object